In [7]:
import numpy as np
import pandas as pd

In [20]:
items = {
    'names':  ['aman','raman','kaman','chaman','daman'],
    'age': [23,24,23,35,68],
    'strength' :[5,4,5,2,1],
    'exp' : [1,2,0,12,30]
}

In [21]:
data = pd.DataFrame(items)

In [22]:
data

    names  age  strength  exp
0    aman   23         5    1
1   raman   24         4    2
2   kaman   23         5    0
3  chaman   35         2   12
4   daman   68         1   30

In [23]:
#used to find correlation between columns 
data.corr()

               age  strength       exp
age       1.000000 -0.883476  0.991919
strength -0.883476  1.000000 -0.932757
exp       0.991919 -0.932757  1.000000

In [26]:
#-ve means that on the graph there is a downward curve
#+ve means that on the graph there is a upwardward curve

# we take abs(corr) because negative and postive just shows the curve on the graph 
# Low = 0.0 to 0.3
# moderate = 0.3 to 0.7
# high = 0.8 to 1.0